just_paint.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Just paint</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">Just paint</h1>
<p>
I. Parable from my aunt
</p>

<p>
My uncle and aunt travelled to India for a sabatical. They were there for a few months. My aunt, who is quite the artist, had a grand idea to "paint India" wherever she went. But when she was there in the moment, getting ready to paint, she would note that things weren't quite the way she wanted them to be. Maybe it wasn't the setting she had in mind. Or maybe the colors she had on the palette didn't quite match what she was seeing. So she wouldn't paint and wait for the next opportunity. And that one wouldn't be quite right either. 
</p>

<p>
Later on in the trip she realized that the nitty gritty didn't matter as much as she thought it did and she needed to just paint. When she adopted this mentality, everything got better both in terms of productivity and satisfaction. The key was to just paint.
</p>

<p>
I come from academia, where you don't publish until your work is as perfect as you can get it. And even then, the dreaded <a href="https://shitmyreviewerssay.tumblr.com/">Reviewer 3</a> has some bone to pick with what you did. So the perfectionist mentality is still in me, slowing down if not stopping what I output. 
</p>

<p>
The end result is either I don't show what I'm working on because it's not to my liking, or I decide not to do something because I don't think I'll be good at it or produce something that is to my liking. 
</p>

<p>
You're going to be on this earth for <a href="https://en.wikipedia.org/wiki/Life_expectancy">80 years or so</a>, and then you're gone. We are here, at least in part, to express ourselves. As Alan Watts likes to say, <a href="https://www.youtube.com/watch?v=nesFD_XcNz4">life is a musical piece</a>, and we are supposed to sing and dance while the music is being played. Just paint.
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: June 27, 2022 - June 28, 2022</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"></p>
</div>
</body>
</html>
